package curriculum_B;

public class Qes2 {

	public static void main(String[] args) {
		
	/*****************************************************************************
	問１　int型の変数scoreに75を代入、scoreが60以上なら合格ですと表示
	 *****************************************************************************/
		
		int score = 75;
		
		if (score >= 60) {
			System.out.println("合格です！");// 出力：合格です
		}
		
		
	/*****************************************************************************
	問２　int型の変数ageに25を代入、ageが20以上30以下なら「適正年齢です」と表示。
	      それ以外の場合は「対象外です」と表示
	 *****************************************************************************/
		
		int age = 25;
		
		if (age >= 20 && age <= 30){// 20以上かつ30以上
			System.out.println("適正年齢です");
		} else{
			System.out.println("対象外です");
		}// 出力：適正年齢です
		
		
	/*****************************************************************************
	問３　int型の変数ageに18を代入、ageが20以上なら「成人です」と表示。
	　　　ageが13以上19以下なら「ティーンエイジャーです」と表示
	      ageが12以下なら「子供です」と表示
	 *****************************************************************************/		
		
		age = 18;// ageを更新
		
		if (age >= 20){// 20以上
			System.out.println("成人です");
		} else if (age >=13 && age <= 19){// 13以上19以下
			System.out.println("ティーンエイジャーです");
		} else {
			System.out.println("子供です");
			}// その他（12歳以下）
		
		
	/*****************************************************************************
	問４　int型の変数x,y,zにそれぞれ30，15，50を代入
	一番大きい数字を判定して表示
	 *****************************************************************************/				
		
		int x = 30;
		int y = 15;
		int z = 50;
		
		int max = x;// 仮のMAXとしてxを代入
		if (y > max){// yがMAXか検討
			max = y;// 現MAXよりyが大きければ置き換え
		} if (z > max){// zがMAXか検討
			max = z;// 現MAXよりzが大きければ置き換え
		} System.out.println(max);// MAXを表示
		
		
	/*****************************************************************************
	問５　int型の変数numを用意。
	num の値が 0 より大きければ "正の数です" と表示
	num の値が 0 なら "0 です" と表示
	num の値が 0 より小さければ "負の数です" と表示
	 *****************************************************************************/				
		
		int num = 0;// 任意の数字
		
		if (num > 0){
			System.out.println("正の数です");
		} else if (num == 0){
			System.out.println("0です");
		} else {
			System.out.println("負の数です");
		}
		
		
	/*****************************************************************************
	問６　int型の変数valueを用意。
	valueが偶数なら "偶数です" と表示
	valueが奇数なら "奇数です" と表示
	 *****************************************************************************/		
		
		int value = 1;// 任意の数字
		
		if (value % 2 == 0) {// 2で割った余りが0なら偶数。
			System.out.println("偶数です");
		} else {
			System.out.println("奇数です");
		}
		
		
	/*****************************************************************************
	問７　int 型の変数 score に 0 から 100 の数値を代入
	90 以上なら "優"
	70 以上なら "良"
	50 以上なら "可"
	50 未満なら "不可"　を表示
	 *****************************************************************************/	
		
		score = 75;// 任意の数値、変数score更新
		
		  if (score >= 90) {
			System.out.println("優");
		} else if (score >= 70 && score < 90) {// 70以上90未満
			System.out.println("良");
		} else if (score >= 50 && score <70) {// 50以上70未満
			System.out.println("可");
		} else {
			System.out.println("不可");		// その他（50未満)
		}
		
		
	/*****************************************************************************
	問８ 入力が null または空文字（""）のときに
	「入力が無効です」と表示する処理を作成してください
	 *****************************************************************************/ 
		  
		  String input = "";// 任意の文字
		  
		  if (input == null || input.isEmpty()) {// inputがnullまたは空文字の場合
			  System.out.println("入力が無効です");
		  } else {
			  System.out.println(input);
		  }
		  
	 /*****************************************************************************
	 問９ int型の変数dayを用意（１～７の数値を代入）
	 dayの値に応じて曜日を表示
	 １→月曜日
	 ２→火曜日
	 ３→水曜日
	 ・
	 ・
	 ・
	 それ以外の値なら「無効な入力です」と表示
	 ※switch文を使用
	  *****************************************************************************/
		  
		  int day = 2;// 任意の数値
		  
		  switch (day) {
		  case 1:
			  System.out.println("月曜日");
			  break;
		  case 2:
			  System.out.println("火曜日");
			  break;
		  case 3:
			  System.out.println("水曜日");
			  break;
		  case 4:
			  System.out.println("木曜日");
			  break;
		  case 5:
			  System.out.println("金曜日");
			  break;
		  case 6:
			  System.out.println("土曜日");
			  break;
		  case 7:
			  System.out.println("日曜日");
			  break;
		  default:
			  System.out.println("無効な入力です");// どのcaseにも該当しなかった場合の処理
		  }
		  
		  
	 /*****************************************************************************
		問９ int型の変数を用意month（1~12の数値を代入）
		monthの値に応じて季節を表示
		１２，１，２→冬
		３，４，５→春
		６，７，８→夏
		９，１０，１１→秋
		それ以外の値なら「無効な月です」と表示
		※switch文を使用
	  *****************************************************************************/	  
		  
		  int month = 1;// 任意の数値
		  
		  switch (month) {
		  case 1: case 2: case 12:
			  System.out.println("冬");
			  break;
		  case 3: case 4: case 5:
			  System.out.println("春");
			  break;
		  case 6: case 7: case 8:
			  System.out.println("夏");
			  break;
		  case 9: case 10: case 11:
			  System.out.println("秋");
			  break;
		  default:
			  System.out.println("無効な月です");// どのcaseにも該当しなかった場合の処理
		  }
		  
		  
	}

}
