package curriculum_B;

import java.util.Random;
import java.util.Scanner;

public class Qes3 {

	public static void main(String[] args) {

	/***********************************************************************
	 * 問１　for文を使って 1 から 10 までの数字を 1 つずつ表示	
	 ***********************************************************************/
		
		for (int i = 1; i <= 10; i++) {// 初期化、条件、増減処理
			System.out.println(i);
		}
	
		
	/***********************************************************************	
	 * 問２　for文を使って 2 から 20 までの 偶数 を 1 つずつ表示	
	 ***********************************************************************/

		for (int i = 1; i <= 20; i++) {// 初期化、条件、増減処理
			if (i % 2 == 1) {// iを2で割ったあまりが1の場合
				continue;
			} System.out.println(i);
		}
		
		
	/***********************************************************************	
	 * 問３　for文を使って 10 から 1 まで カウントダウンして表示	
	 ***********************************************************************/
		
		for (int i = 10; i >= 1; i--) {// 初期化10、条件は1まで、増減処理（1ずつ減らす）
			System.out.println(i);
		}
		
		
	/***********************************************************************	
	 * 問４　for文を使って 1 から 100 までの合計 を表示	
	 ***********************************************************************/	
		
		int sum = 0;// 足し算の式
		
		for (int i = 1; i <= 100; i++) {
			sum += i;// sum = sum + iの省略形
		} System.out.println(sum);
		
		
	/***********************************************************************	
	 * 問５　for文を使って三角形を表示	
	 ***********************************************************************/	
		
		String name[] = {"*", "**", "***","****","*****"};
		for (String str: name){ //(データ型 変数名: コレクション)
			System.out.println(str);
		}
		
		
	/***********************************************************************
	 * 問６　while文を使って 1 から 10 までの数字を 1 つずつ表示	
	 ***********************************************************************/	
		
		int count = 1;//カウンター変数初期化
		while (count <= 10) {// countが10以下の場合ループ
			System.out.println(count);
			count ++;// countを1ずつ増やす
		}
		
		
	/***********************************************************************	
	 * 問７　while文を使って 2 から 20 までの 偶数 を 1 つずつ表示	
	 ***********************************************************************/	
		
		count = 1;// カウンター変数更新
		while (count <= 20) {// countが20以下の場合ループ
			if (count % 2 == 1) {// countを2で割って余りが1の場合→奇数
				count ++;// countを1ずつ増やす
				continue;// 奇数を飛ばす
			} System.out.println(count);
			    count ++;		
		} 
		
		
	/***********************************************************************	
	 * 問８　while文を使って 10 から 1 まで カウントダウンして表示	
	 ***********************************************************************/	
		
		count = 10;
		while (count >= 1) {
			System.out.println(count);
			count --;
		} 
		
		
	/***********************************************************************	
	 * 問９　while文を使って 1 から 100 までの合計 を表示	
	 ***********************************************************************/	
		
		sum = 0;
		count = 1;
		while (count <= 100){
			sum += count;
			count ++;
		} System.out.println(sum);
		
		
	/***********************************************************************	
	 * 問１０　ユーザーから 数値を入力 してもらう
	 * 入力が 0 になるまで 何度でも入力を受け付ける
	 * 0が入力されたら「終了しました」と表示
	 * ※Scannerを使用 かつ　while文を使用
	 ***********************************************************************/	
		
		 Scanner scanner = new Scanner(System.in);// Scannerのインスタンスを作成
		 int num;
		 
		 System.out.println("任意の数値を入力：");
		
		while (true) {// 入力０以外は繰り返す
			num = scanner.nextInt();// 数値の入力を受ける
			
			if (num == 0) {
				break;// 入力が０ならループ終了
			}
		} System.out.println("終了しました");
		scanner.nextLine();// 問12のためにScannerクローズせず
		
		
	/***********************************************************************	
	 * 問１１　for文を使って九九の表を表示	
	 ***********************************************************************/
		
		for (int i = 1; i <= 9; i++) {// 行
			for (int j = 1; j <= 9; j++) {// 列
				System.out.printf("%02d * %02d = %02d", j, i, j * i);// 数字の表示が一桁の時は前に0をつけるように
				
				if (j < 9) {
					System.out.print(" || ");// 間の記号
				}
			} System.out.println();// 列終わり→改行
		
		}
		
		
	/***********************************************************************	
	 * 問１2	
	 ***********************************************************************/	
		
		 
	     Random random = new Random();
		
		 // 入力
        System.out.println("商品名を入力してください（商品名の間は「、」を入れてください）：");
        String input = scanner.nextLine();
        String[] items = input.split("、");

        // テレビとディスプレイの合計を11にする
        int tv = random.nextInt(12); // 0〜11
        int display = 11 - tv;

        for (String item : items) {
        	// ループ処理
            switch (item) {
                case "パソコン": case "冷蔵庫": case "扇風機": case "洗濯機": case "加湿器":
                    int stock = random.nextInt(12); // 0〜11
                    System.out.println(item + "の残り台数は" + stock + "台です");
                    break;

                case "テレビ": case "ディスプレイ":
                    String set = item.equals("テレビ")
                            ? "テレビの残り台数は" + tv + "台です" : "ディスプレイの残り台数は" + display + "台です";
                    System.out.println(set);
                    break;

                default:
                    System.out.println(" 『" + item + "』は指定の商品ではありません"); // メッセージ出力
            }
        }

        scanner.close();// Scannerをクローズ
	}
		
}

