package curriculum_A;

public class Que1 {

	public static void main(String[] args) {
		/**********************************************************************************
		問１ 変数宣言、初期値の設定
		**********************************************************************************/
			
			byte byteNum;// byte宣言		
			short shortNum; // short宣言		
			int intNum; // int宣言		
			long longNum; // long宣言		
			float floatNum; // float宣言		
			double doubleNum; // double宣言		
			char letter; // char宣言		
			String letters; //String宣言		
			boolean isBoolean; //boolean宣言		
			
	    /**********************************************************************************
		問２ 変数に指定された値を代入
		**********************************************************************************/
			
			// 問１で宣言した変数にそれぞれ値を代入	   
			byteNum = 10;
			shortNum = 100;
			intNum = 1000;
			longNum = 10000;
			floatNum = 9.5f;
			doubleNum = 10.5;
			letter = 'a';
			letters = "ハロー";
			isBoolean = true;
			
		/**********************************************************************************
	    問３ 変数を用いて出力
	    **********************************************************************************/
			
			// 11110を出力	
			System.out.println(byteNum + shortNum + intNum + longNum);
			// 20を出力	
			System.out.println(byteNum + byteNum);
			// a ハロー trueを出力
			System.out.println(letter + letters + isBoolean);
			// 11130 をすべて足して出力
			System.out.println(byteNum + byteNum + byteNum + shortNum + intNum + longNum);
			// 10000000000を小数点以外の数字を全てかけて出力
			System.out.println(byteNum * shortNum * intNum * longNum);
			// 0.105を出力
			System.out.println(doubleNum / shortNum);
			// -90を出力
			System.out.println(byteNum - shortNum);
		
		/**********************************************************************************
		問４ String型でnameという変数を宣言し、
		　　その変数に山田太郎という値を代入
		　　コンソールにこんにちは、山田太郎さん！と表示
		**********************************************************************************/
			
			String name;// 変数を定義
			name = "山田太郎";// 値を代入
			System.out.println("こんにちは、" + name + "さん！");// コンソールに出力
			
		/**********************************************************************************
		問５　int型でageという変数を宣言し、
		　　その変数に25という値を代入
		　　コンソールに年齢: 25歳と表示
		**********************************************************************************/	
			
			int age;// 変数を定義
			age = 25;// 値を代入
			System.out.println("年齢: " + age);// コンソールに表示
		
		/**********************************************************************************
		問６　int型でnum1という変数を宣言し、その変数に10という値を代入
		     同じくnum2という変数を宣言し、5を代入
		　　 それぞれを足してsumという変数に代入し、コンソールに表示
		**********************************************************************************/	
			
			int num1;// 変数を定義
			num1 = 10;// 値を代入
			int num2;// 変数を定義
			num2 = 5;// 値を代入
			int sum;// 変数を定義
			sum = num1 + num2;// 代入する値を足し算で代入
			System.out.println(sum);// コンソールに表示
			
		/**********************************************************************************
		問７　int型でscoreという変数を宣言し、その変数に80という値を代入
		    scoreに20を加えて更新する。
		　　コンソールに最終スコア: 100と表示
		**********************************************************************************/	
			
			int score = 80;// 変数intを定義、80を代入
			score = score + 20;// 再代入＆更新
			System.out.println(score);// コンソールに表示
			
		/**********************************************************************************
		問８　double型でpriceという変数を宣言し、その変数に99.99という値を代入
		    priceをint型に変換する。
		　　コンソールに整数価格: 99と表示
		***********************s***********************************************************/			
			
			double price = 99.99;
			int price1 = (int)price;// double変数priceをintに変換		
			System.out.println("整数価格: " + price1);// 出力「整数価格: 99」
			
		/**********************************************************************************
		問９　String型でnumStrという変数を宣言し、その変数に123という値を代入
		    numStrをint型に変換する。
		　　コンソールに返還後の値: numStr + 10した値を表示
		***********************s***********************************************************/		
			
			String numStr = "123";
			int numStr1 = Integer.parseInt(numStr);// 文字列をintに変換
			System.out.println(numStr1 + 10);// 出力: 133
			
		/**********************************************************************************	
		問１０　int型の変数numに50代入。
		numをString型に変換し、得点: 50点と表示
		***********************s***********************************************************/
			
			int num = 50;
			String str = String.valueOf(num);// intを文字列に変換
			System.out.println("得点: " + str + "点");// 出力：得点: 50点
			
		/**********************************************************************************
		問１１　条件演算子を用いて
		int型の変数aに10を代入、変数bに5を代入。aがbより小さいかどうかをboolean変数resultに代入
		resultの値を表示
	　　***********************s***********************************************************/
			
			int a = 10;
			int b = 5;
			boolean result = (a < b);
			System.out.println(result);// false
			
		/**********************************************************************************
		問１２　条件演算子を用いて
		int型の変数Xに15を代入。
		xの値が10以上ならOK、そうでなければNGを表示
		***********************s***********************************************************/	
			
			int x = 15;
			boolean r = (x > 10);// xが10以上
			String result2 = r ? "OK" : "NG";
			System.out.println(result2);// OK

		/**********************************************************************************
		問１３　String text = "私はJavaが好きです。Javaは楽しい！";という
	    文章の中にある 「Java」 を 「Python」 に置き換えて表示
		***********************s***********************************************************/
			
			String text = "私はJavaが好きです。Javaは楽しい！";
			String python = text.replace("Java", "Python");// テキスト置き換え
			System.out.println(python);// 出力
			
		}

	}
